#  Следует пояснить по поводу файла процессов (Procfile): в бесплатной версии мы можем создавать до двух процессов, по 1 на каждый тип.
# типы процессов:
#	web - исполняемый файл*, который будет получать входящий трафик от роутеров heroku. Этими исполняемыми файлами являются: боты, работающие на основе вебхуков, веб серверы.
#	worker: python %not_web_app%.py //исполняемый файл, которому не требуется входящий трафик для работы


# работает корректно
web: gunicorn main:application

# скрипт отрабатывает, но аппа завершается после этого
# web: python just_code.py